SELECT Н_ОЦЕНКИ.КОД, Н_ВЕДОМОСТИ.ИД
FROM Н_ОЦЕНКИ
         INNER JOIN Н_ВЕДОМОСТИ ON Н_ОЦЕНКИ.КОД = Н_ВЕДОМОСТИ.ОЦЕНКА
WHERE Н_ОЦЕНКИ.ПРИМЕЧАНИЕ < 'незачет' AND
    Н_ВЕДОМОСТИ.ИД < 1490007 AND Н_ВЕДОМОСТИ.ИД = 1490007;







SELECT Н_ЛЮДИ.ИД, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ДАТА
FROM Н_ВЕДОМОСТИ
         LEFT JOIN Н_ЛЮДИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
         LEFT JOIN Н_СЕССИЯ ON Н_СЕССИЯ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ > 'Соколов'
  AND Н_ВЕДОМОСТИ.ИД = 1490007;





--EXPLAIN ANALYZE